In [2]:
import pandas as pd

In [3]:
# Pandas work with structured data like excel file , csv file

In [19]:
df = pd.read_csv("students.csv")
df

    name  roll  age height
0    ram    12   30  170cm
1   hari    13   17  165cm
2  rohit    14   28  175cm

In [8]:
df.loc[0]              #.loc for row index

name        ram
roll         12
age          30
height    170cm
Name: 0, dtype: object

In [10]:
df.loc[0,'name']     # .loc providing value at row 0 and column 'name'

'ram'

In [7]:
df['name']

0      ram
1     hari
2    rohit
Name: name, dtype: object

In [11]:
df.shape

(3, 4)

In [12]:
df.dtypes

name      object
roll       int64
age        int64
height    object
dtype: object

In [13]:
# column are the series or intities of a data frame ; series is singular numpy array wi

In [14]:
df.age.mean()

25.0

In [15]:
df.age.std()

7.0

In [16]:
df.height.dtype

dtype('O')

In [22]:
df['height']=df.height.str[:-2].astype('uint64')   #slicing two characters from height column

In [23]:
df

    name  roll  age  height
0    ram    12   30     170
1   hari    13   17     165
2  rohit    14   28     175

In [25]:
df.dtypes

name      object
roll       int64
age        int64
height    uint64
dtype: object

In [27]:
df2=df.query('height >= 170')

In [28]:
df2

    name  roll  age  height
0    ram    12   30     170
2  rohit    14   28     175

In [29]:
import numpy as np

In [31]:
arr1 = np.array([1,2,3])

In [32]:
arr1 > 10

array([False, False, False])

In [34]:
mask = df.height >= 170

In [35]:
mask

0     True
1    False
2     True
Name: height, dtype: bool

In [36]:
df.loc[mask]

    name  roll  age  height
0    ram    12   30     170
2  rohit    14   28     175

In [37]:
df.loc[df.height >= 170]

    name  roll  age  height
0    ram    12   30     170
2  rohit    14   28     175